app/controllers/discount_controller.rb

  def index
  	 @search = Website.search(params[:q])
  	 @search.sorts = 'name' if @search.sorts.empty?
     @websites = @search.result.page(params[:page]).per(20)
---
SELECT "websites".* FROM "websites"
SELECT COUNT(*) FROM "websites"
SELECT "websites".* FROM "websites" ORDER BY "websites"."name" DESC LIMIT 20 OFFSET 0