app/controllers/mysavings_controller.rb

SELECT "medicines".* FROM "medicines"
---
  def index
  	@mycart = cookies[:cart].nil? ? [] : cookies[:cart].split("&")
	  @savings = Medicine.search({id_in: @mycart}).result unless @mycart.empty?