app/controllers/prescription_controller.rb

SELECT "medicines".* FROM "medicines" ORDER BY "medicines"."name" ASC
SELECT COUNT(*) FROM "medicines" WHERE ("medicines"."name" ILIKE '%amruth%')
SELECT "medicines".* FROM "medicines" WHERE ("medicines"."name" ILIKE '%amruth%') ORDER BY "medicines"."name" ASC LIMIT 4 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "medicines" WHERE ("medicines"."name" ILIKE '%fdsf dsf dsf %') LIMIT 4 OFFSET 0) subquery_for_count
---
  def index
    @search = Medicine.search(params[:q])
    @mains = Medicine.search(params[:q])
    @search.sorts = 'name' if @search.sorts.empty?
    @medicines = @search.result.page(params[:page]).per(4)

SELECT "medicines"."name", "medicines"."id" FROM "medicines" WHERE ("medicines"."name" ILIKE '%amruth%') ORDER BY "medicines"."name" ASC
---
  def autocomplete
  	@mysearch = Medicine.search({name_cont: params[:query]}).result.pluck(:name)